Reports/Замеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>Замеры</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/Замеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Замеры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Замер</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УДАЛИТЬ_Невыходы</v8:Type>
						<v8:Type>cfg:DocumentRef.УДАЛИТЬ_Замер</v8:Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗамерВыполнен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийЗамерщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтсутствиеИсполнителя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыЗамера</v8:Type>
						<v8:Type>cfg:CatalogRef.РезультатЗамераЛида</v8:Type>
						<v8:Type>cfg:CatalogRef.РезультатыВыездаЛида</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтказаЗамера</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Геометка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЭтоВыезд</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНазначенияЗамера</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументЗамер</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДЗамера</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначилЗамер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначилЗамерПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/Замеры/Forms/УДАЛИТЬ_ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Функция СформироватьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Замеры.Дата КАК ДатаЗамера,
	|	Замеры.ВремяНачала КАК ВремяЗамера,
	|	Замеры.ВремяОкончания КАК ВремяОкончания,
	|	ВЫБОР
	|		КОГДА Замеры.Город = ЗНАЧЕНИЕ(Справочник.Города.ПустаяСсылка)
	|			ТОГДА Замеры.Адрес
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Замеры.Адрес = """" 
	|               	ТОГДА Замеры.Город.Наименование
	|				ИНАЧЕ Замеры.Город.Наименование + "", "" + Замеры.Адрес
	|			КОНЕЦ
	|	КОНЕЦ КАК Адрес,
	|	Замеры.ИмяКлиента КАК ФИОКлиента,
	|	Замеры.Регистратор.ОсновнойТелефонКлиента КАК ТелефонКлиента,
	|	Замеры.Комментарий КАК Комментарий,
	|	Замеры.Сотрудник КАК Замерщик
	|ИЗ
	|	РегистрСведений.Замеры КАК Замеры
	|ГДЕ
	|	Замеры.Дата МЕЖДУ &НачалоДатаЗамера И &КонецДатаЗамера
	|	И ВЫБОР
	|			КОГДА &Замерщик = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Замеры.Сотрудник = &Замерщик
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &НазначилЗамер = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Замеры.Регистратор.ПоследнийНазначилЗамер = &НазначилЗамер
	|		КОНЕЦ
	|	И НЕ Замеры.Результат В (ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерНеПроизводился), ЗНАЧЕНИЕ(Справочник.РезультатЗамераЛида.ЗамерОтменен))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаЗамера,
	|	ВремяЗамера";
	Запрос.УстановитьПараметр("Замерщик", Замерщик);
	Запрос.УстановитьПараметр("НазначилЗамер", НазначилЗамер);
	Запрос.УстановитьПараметр("НачалоДатаЗамера", НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("КонецДатаЗамера", КонецДня(Период.ДатаОкончания));	
	
	ТабЗнач = Запрос.Выполнить().Выгрузить();
	Даты = ТабЗнач.Скопировать();
	Даты.Свернуть("ДатаЗамера");
	
	ТаблицаЗамерщиков = ТабЗнач.Скопировать();
	ТаблицаЗамерщиков.Свернуть("Замерщик");
	
	Таб = Новый ТабличныйДокумент;
	
	ЭтотОтчет = РеквизитФормыВЗначение("Отчет");
	Макет = ЭтотОтчет.ПолучитьМакет("УДАЛИТЬ_Макет");
	
	ОбластьКлиент = Макет.Область("Клиент");
	ОбластьКлиент.ШиринаКолонки = ?(НеВыводитьТелефоны, 9.5, 4.75);
	
	Если ЗначениеЗаполнено(Замерщик) Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Замерщик");
		ОбластьМакета.Параметры.Замерщик = Замерщик;
		Таб.Вывести(ОбластьМакета);
	КонецЕсли;
	Если ЗначениеЗаполнено(НазначилЗамер) Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("НазначилЗамер");
		ОбластьМакета.Параметры.НазначилЗамер = НазначилЗамер;
		Таб.Вывести(ОбластьМакета);
	КонецЕсли;
	
	Если Даты.Количество() = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ЗамеровНет");
		Таб.Вывести(ОбластьМакета);
		Возврат Таб;
	КонецЕсли;
	
	Для Каждого Строка из Даты Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("ДатаЗамера");
		ОбластьМакета.Параметры.Дата = Формат(Строка.ДатаЗамера, "ДФ=dd.MM.yyyy");
		Таб.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Замер");
		Таб.Вывести(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Клиент");
		Таб.Присоединить(ОбластьМакета);
		Если НЕ НеВыводитьТелефоны Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Телефон");
			Таб.Присоединить(ОбластьМакета);
		КонецЕсли;
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Комментарий");
		Таб.Присоединить(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Конец");
		Таб.Присоединить(ОбластьМакета);
		
		Для каждого СтрокаЗамерщик из ТаблицаЗамерщиков Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("ДатаЗамера", Строка.ДатаЗамера);
			Отбор.Вставить("Замерщик", СтрокаЗамерщик.Замерщик);			
			СтрокиЗамеров = ТабЗнач.НайтиСтроки(Отбор);
			Если СтрокиЗамеров.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаЗамерщик|Замер");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, СтрокаЗамерщик);
			Таб.Вывести(ОбластьМакета);
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаЗамерщик|Клиент");
			Таб.Присоединить(ОбластьМакета);
			Если НЕ НеВыводитьТелефоны Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаЗамерщик|Телефон");
				Таб.Присоединить(ОбластьМакета);
			КонецЕсли;
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаЗамерщик|Комментарий");
			Таб.Присоединить(ОбластьМакета);
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаЗамерщик|Конец");
			Таб.Присоединить(ОбластьМакета);
									
			Для Каждого СтрокаЗамера Из СтрокиЗамеров Цикл
				
				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Замер");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, СтрокаЗамера);
				ОбластьМакета.Параметры.ВремяЗамера = Формат(СтрокаЗамера.ВремяЗамера, "ДФ=HH:mm") + " - " + Формат(СтрокаЗамера.ВремяОкончания, "ДФ=HH:mm");
				Таб.Вывести(ОбластьМакета);
				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Клиент");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, СтрокаЗамера);
				Таб.Присоединить(ОбластьМакета);
				Если НЕ НеВыводитьТелефоны Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("Строка|Телефон");
					ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, СтрокаЗамера);
					Таб.Присоединить(ОбластьМакета);
				КонецЕсли;
				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Комментарий");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, СтрокаЗамера);
				Таб.Присоединить(ОбластьМакета);
				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Конец");
				Таб.Присоединить(ОбластьМакета);
				
			КонецЦикла;
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал|Замер");
		Таб.Вывести(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал|Клиент");
		Таб.Присоединить(ОбластьМакета);
		Если НЕ НеВыводитьТелефоны Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал|Телефон");
			Таб.Присоединить(ОбластьМакета);
		КонецЕсли;
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал|Комментарий");
		Таб.Присоединить(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал|Конец");
		Таб.Присоединить(ОбластьМакета);
	КонецЦикла;
	Возврат Таб;
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	Результат = СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период.ДатаНачала = ТекущаяДатаСеанса();
	Период.ДатаОкончания = ТекущаяДатаСеанса();
КонецПроцедуры

&НаСервере
Процедура ПериодПриИзмененииНаСервере()
	Если Не ЗначениеЗаполнено(Период.ДатаНачала) И Не ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		Период.ДатаНачала = ТекущаяДатаСеанса();
		Период.ДатаОкончания = ТекущаяДатаСеанса();
	ИначеЕсли Не ЗначениеЗаполнено(Период.ДатаНачала) Тогда
		Период.ДатаНачала = Период.ДатаОкончания;
	ИначеЕсли Не ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		Период.ДатаОкончания = Период.ДатаНачала;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПериодПриИзмененииНаСервере();
КонецПроцедуры
